music_app/app/controllers/albums_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def new
    @band = Band.find(params[:band_id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @album = Album.find(params[:id])
    @band = Band.find(@album.band_id)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "update test !"], ["updated_at", "2018-11-16 00:31:02.573582"], ["id", 4]]
---
  def update
    album = Album.find(params[:id])

    if album.update_attributes(album_params)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def edit
    @album = Album.find(params[:id])
    @band = Band.find(@album.band_id)

INSERT INTO "albums" ("title", "yr", "created_at", "updated_at", "band_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "update test"], ["yr", 2000], ["created_at", "2018-11-16 00:29:48.558767"], ["updated_at", "2018-11-16 00:29:48.558767"], ["band_id", 3]]
---
  def create
    album = Album.new(album_params)

    if album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 5]]
---
  def destroy
    album = Album.find(params[:id])
    band = Band.find(album.band_id)
    album.delete