music_app/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "sM1jE28x1Hn78ZKpQZAVEg"], ["LIMIT", 1]]
---
  def current_user
    return nil unless session[:session_token]
    User.find_by(session_token: session[:session_token])