music_app/app/controllers/bands_controller.rb

  def create
    band = Band.new(band_params)

    if band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "The Beatles"], ["created_at", "2018-11-15 21:43:14.046325"], ["updated_at", "2018-11-15 21:43:14.046325"]]

  def update
    @band = Band.find(params[:id])

    if @band.update_attributes(user_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Random Band"], ["updated_at", "2018-11-15 22:23:24.539582"], ["id", 1]]

  def destroy
    @band = Band.find(params[:id])
    @band.delete
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 2]]