music_app/app/views/bands/show.html.erb

  <container class="album_list">
    <% @band.albums.each do |album| %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 5]]